src/Documents/НачислениеПремий/НачислениеПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПремий</name>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйПериодНачало</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйПериодКонец</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ПроизводственныйКалендарь</schedule>
  <scheduleValue>InformationRegister.ПроизводственныйКалендарь.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.ПроизводственныйКалендарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Параметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <recalculations>
    <name>Перерасчет1</name>
  </recalculations>
</mdclass:CalculationRegister>

src/Documents/НачислениеПремий/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Начисления
	Движения.Начисления.Записывать = Истина;
	Движение = Движения.Начисления.Добавить();
	//Движение.Сторно = Ложь;
	Движение.ПериодДействияНачало = НачалоМесяца(Дата);
	Движение.ПериодДействияКонец = НачалоМесяца(Дата); 
	
	Движение.БазовыйПериодНачало = БазовыйПериодНачало;
	Движение.БазовыйПериодКонец = БазовыйПериодКонец;
	
	Движение.ПериодРегистрации = Дата;
	Движение.Сотрудник = Сотрудник;  
	Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Премия;  
	Движение.Параметр = ПроцентПремии;  
	
	Движения.Начисления.Записать(); 
	
	Запись = Движения.Начисления[0];
	
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("Начисления.Сумма"); 
	
	Измерения = Новый Структура;
	Измерения.Вставить("Сотрудник", "Начисления.Сотрудник");
	
    ТЗБаза = Запись.ПолучитьБазу(Ресурсы, Измерения);
	
	Запись.Сумма = ТЗБаза[0].Сумма * ПроцентПремии / 100;
	
	
	Движения.Начисления.Записать();

КонецПроцедуры
